Repository: ShuhratX/drinkshop
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Uzbek
uz: O'zbek tili

source: Russian
uz: Rus tili

source: name
uz: nomi

source: Category
uz: Kategoriya

source: Categories
uz: Kategoriyalar

source: Brand
uz: Brend

source: Brands
uz: Brendlar

source: title
uz: nomlanishi

source: description
uz: tafsilot

source: price
uz: narx

source: size
uz: o'lcham

source: stock_count
uz: miqdor

source: Product
uz: Maxsulot

source: Products
uz: Maxsulot

source: image
uz: rasm

source: Image
uz: Rasm

source: Images
uz: Rasmlar

source: Delete selected %(verbose_name_plural)s
uz: %(verbose_name_plural)s tanlanganlarni o'chirish

source: Successfully deleted %(count)d %(items)s.
uz: %(count)d%(items)s muvaffaqiyatli o'chirildi.

source: Cannot delete %(name)s
uz: %(name)s o'chirib bo'lmadi

source: Are you sure?
uz: Ishonchingiz komilmi?

source: Administration
uz: Administratsiya

source: All
uz: Hammasi

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Unknown
uz: Noma'lum

source: Any date
uz: Ixtiyoriy kun

source: Today
uz: Bugun

source: Past 7 days
uz: Oxirgi 7 kun

source: This month
uz: Shu oyda

source: This year
uz: Shu yilda

source: No date
uz: Sanasi yo'q

source: Has date
uz: Sanasi bor

source: Empty
uz: Bo'sh

source: Not empty
uz: Bo'sh emas

source: Please enter the correct %(username)s and password for a staff account. Note that both fields may be case-sensitive.
uz: Xodimlar akkaunti uchun to'g'ri %(username)s va parolni kiriting. E'tibor bering, har ikkala maydon ham harf katta-kichikligini hisobga olishi mumkin.

source: Action:
uz: Harakat:

source: Add another %(verbose_name)s
uz: Boshqa %(verbose_name)s qo‘shish

source: Remove
uz: Olib tashlash

source: Addition
uz: Qo‘shish

source: Change
uz: O‘zgartirish

source: Deletion
uz: O‘chirish

source: action time
uz: harakat vaqti

source: user
uz: foydalanuvchi

source: content type
uz: tarkib turi

source: object id
uz: obyekt identifikatori

source: object repr
uz: obyekt taqdimi

source: action flag
uz: harakat bayrog'i

source: change message
uz: xabarni o'zgartirish

source: Added “%(object)s”.
uz: "%(object)s" qo'shildi.

source: Changed “%(object)s” — %(changes)s
uz: %(object)s dan %(changes)sga o'zgartirildi.

source: Deleted “%(object)s.”
uz: "%(object)s" o'chirildi.

source: Added {name} “{object}”.
uz: {name} “{object} qo‘shildi ”.

source: Added.
uz: Qo‘shildi

source: and
uz: va

source: Changed {fields} for {name} “{object}”.
uz: {name} “{object}” dagi {fields} o‘zgartirildi.

source: Changed {fields}.
uz: {fields} o‘zgartirildi.

source: Deleted {name} “{object}”.
uz: {name} “{object}” o‘chirildi.

source: No fields changed.
uz: Maydonlar o‘zgartirilmagan

source: None
uz: Bo‘sh

source: Hold down “Control”, or “Command” on a Mac, to select more than one.
uz: Bittadan ko'p belgilash uchun "Control", yoki Mac da "Command" ni bosing

source: The {name} “{obj}” was added successfully.
uz: {name} “{obj}” muvaffaqiyatli qo‘shildi

source: You may edit it again below.
uz: Quyida uni tahrirlashingiz mumkin

source: The {name} “{obj}” was added successfully. You may add another {name} below.
uz: {name} “{obj}” muvaffaqiyatli qo‘shildi. Quyida yana {name} qo‘shishingiz mumkin.

source: The {name} “{obj}” was added successfully. You may edit it again below.
uz: {name} “{obj}” muvaffaqiyatli qo‘shildi. Quyida uni tahrirlashingiz mumkin.

source: The {name} “{obj}” was changed successfully.
uz: {name} "{obj}" muvaffaqiyatli o'zgartirildi.

source: Items must be selected in order to perform actions on them. No items have been changed.
uz: Amallarni bajarish uchun qatorlardan tanlashingiz kerak.

source: No action selected.
uz: Hech qanday harakat tanlanmadi

source: The %(name)s “%(obj)s” was deleted successfully.
uz: %(name)s “%(obj)s” muvaffaqiyatli o'chirildi

source: %(name)s with ID “%(key)s” doesn’t exist. Perhaps it was deleted?
uz: “%(key)s” ID li %(name)s topilmadi. O'chirilgan bo'lishi mumkin.

source: Add %s
uz: %s qo'shish

source: Change %s
uz: %s o'zgartirish

source: View %s
uz: %s ko'rish

source: Database error
uz: Ma'lumotlar bazasi bilan bog'liq xatolik

source: %(count)s %(name)s was changed successfully.
uz: %(count)s %(name)s muvaffaqiyatli o'zgartirildi

source: %(total_count)s selected
uz: %(total_count)s tanlandi

source: 0 of %(count)s selected
uz: %(count)s dan tanlanmadi

source: Change history: %s
uz: %s tarixini o'zgartirish

source: Deleting %(class_name)s %(instance)s would require deleting the following protected related objects: %(related_objects)s
uz: %(class_name)s %(instance)s ni o'chirish uchun quyidagilar o'chirilishi kerak Himoyalangan tegishli obyektlar: %(related_objects)s

source: Django site admin
uz: Adminstrator

source: Django administration
uz: Adminstrator paneli

source: Site administration
uz: Sayt adminstratori

source: Log in
uz: Kirish

source: %(app)s administration
uz: %(app)s adminstratori

source: Page not found
uz: Sahifa topilmadi

source: We’re sorry, but the requested page could not be found.
uz: Kechirasiz, lekin so'ralgan sahifa topilmadi

source: Home
uz: Bosh sahifa

source: Server error
uz: Server xatoligi

source: Server error (500)
uz: Server xatoligi (500)

source: Server Error <em>(500)</em>
uz: Server xatoligi <em>(500)</em>

source: There’s been an error. It’s been reported to the site administrators via email and should be fixed shortly. Thanks for your patience.
uz: Tanlangan faoliyatni ishga tushirish

source: Go
uz: Qo'llash

source: Click here to select the objects across all pages
uz: Barcha sahifalardagi obyektlarni tanlash uchun shu erni bosing

source: Select all %(total_count)s %(module_name)s
uz: Barcha sahifalardagi obyektlarni tanlash uchun shu erni bosing

source: Clear selection
uz: Tanlanganlarni tozalash

source: Models in the %(name)s application
uz: %(name)s ilovasidagi modellar

source: Add
uz: Qo'shish

source: View
uz: Ko'rish

source: You don’t have permission to view or edit anything.
uz: Sizda biror narsani ko'rish yoki tahrirlash uchun ruxsat yo'q

source: First, enter a username and password. Then, you’ll be able to edit more user options.
uz: Avval foydalanuvchi nomi va parolni kiriting. Keyin, siz ko'proq foydalanuvchi parametrlarini tahrirlash imkoniyatiga ega bo'lasiz.

source: Enter a username and password.
uz: Foydalanuvchi nomi va parolni kiritish

source: Change password
uz: Parolni o'zgartirish

source: Please correct the error below.
uz: Iltimos, quyidagi xatoni to'g'irlang

source: Please correct the errors below.
uz: Iltimos, quyidagi xatoliklarni to'g'irlang

source: Enter a new password for the user <strong>%(username)s</strong>.
uz: <strong>%(username)s</strong> uchun yangi parolni kiriting

source: Welcome,
uz: Xush kelibsiz,

source: View site
uz: Saytni ko'rish

source: Documentation
uz: Qo'llanma

source: Log out
uz: Chiqish

source: Add %(name)s
uz: %(name)s qo'shish

source: History
uz: Tarix

source: View on site
uz: Saytda ko'rish

source: Filter
uz: Saralash

source: Clear all filters
uz: Filtrlarni tozalash

source: Remove from sorting
uz: Tartiblashdan chiqarish

source: Sorting priority: %(priority_number)s
uz: Saralashning ustuvorligi: %(priority_number)s

source: Toggle sorting
uz: Almashtirishli saralash

source: Delete
uz: O'chirish

source: Deleting the %(object_name)s '%(escaped_object)s' would result in deleting related objects, but your account doesn't have permission to delete the following types of objects:
uz: % (Object_name) s '% (escaped_object) s' ni o'chirib tashlash, tegishli obyektlarni o'chirishga olib keladi, ammo sizning hisob qaydnomangiz quyidagi turdagi obyektlarni o'chirishga ruxsat bermaydi:

source: Deleting the %(object_name)s '%(escaped_object)s' would require deleting the following protected related objects:
uz: %(Object_name)s '%(escaped_object)s'ni o'chirish uchun quyidagi himoyalangan tegishli obyektlarni o'chirish talab qilinadi:

source: Are you sure you want to delete the %(object_name)s "%(escaped_object)s"? All of the following related items will be deleted:
uz: % (Object_name) s "% (escaped_object) s " ni o'chirishni xohlaysizmi? Quyidagi barcha tegishli narsalar o'chiriladi:

source: Objects
uz: Obyektlar

source: Yes, I’m sure
uz: Ha, roziman

source: No, take me back
uz: Yo'q, qaytishnii xohlayman

source: Delete multiple objects
uz: Bir nechta obyektlar o'chirish

source: Deleting the selected %(objects_name)s would result in deleting related objects, but your account doesn't have permission to delete the following types of objects:
uz: olib keladi, ammo sizning hisob qaydnomangizda quyidagilarni o'chirishga ruxsat yo'qobyektlarning turlari:

source: Deleting the selected %(objects_name)s would require deleting the following protected related objects:
uz: Tanlangan %(objects_name)sni o'chirish uchun quyidagi himoyalangan tegishli obyektlarni o'chirish talab qilinadi:

source: Are you sure you want to delete the selected %(objects_name)s? All of the following objects and their related items will be deleted:
uz: Tanlangan% (objects_name) s-ni o'chirishni xohlaysizmi? quyidagi obyektlar va ularga tegishli narsalar hammasi o'chiriladi:

source: Delete?
uz: O'chirasizmi?

source: By %(filter_title)s
uz: %(filter_title)s bo'yicha

source: Summary
uz: Xulosa

source: Recent actions
uz: So'ngi harakatlar

source: My actions
uz: Mening harakatlarim

source: None available
uz: Mavjud emas

source: Unknown content
uz: Tarkib aniqlanmagan

source: Something’s wrong with your database installation. Make sure the appropriate database tables have been created, and make sure the database is readable by the appropriate user.
uz: Ma'lumotlar bazasini o'rnatishda xatolik yuz berdi. Muvofiqligiga ishonch hosil qiling ma'lumotlar bazasi jadvallari yaratilgan va ma'lumotlar bazasi tomonidan o'qilishi" "mumkinligiga ishonch hosil qiling.tegishli foydalanuvchi.

source: You are authenticated as %(username)s, but are not authorized to access this page. Would you like to login to a different account?
uz: Siz %(username)s sifatida ro'yxatdan o'tgansiz, lekin bu sahifaga kirish huquqingiz yo'q.Boshqa hisobga kirishni xohlaysizmi?

source: Forgotten your password or username?
uz: Parol yoki username ni unutdingizmi?

source: Toggle navigation
uz: Navigatsiyani almashtirish

source: Date/time
uz: Sana/vaqt

source: User
uz: Foydalanuvchi

source: Action
uz: Harakat

source: This object doesn’t have a change history. It probably wasn’t added via this admin site.
uz: Ushbu obyektda o'zgarish tarixi yo'q. Ehtimol ushbu panel orqali qo'shilmagan.

source: Show all
uz: Hammasini ko'rish

source: Save
uz: Saqlash

source: Popup closing…
uz: Oyna yopilmoqda…

source: Search
uz: Izlash

source: %(full_result_count)s total
uz: Jami %(full_result_count)s

source: Save as new
uz: Yangi sifatida qo'shish

source: Save and add another
uz: Saqlash va boshqa qo'shish

source: Save and continue editing
uz: Saqlash va tahrirlash

source: Save and view
uz: Saqlash va ko'rish

source: Close
uz: Yopish

source: Change selected %(model)s
uz: Tanlangan %(model)sni o'zgartirish

source: Add another %(model)s
uz: Boshqa %(model)s qo'shish

source: Delete selected %(model)s
uz: Tanlangan %(model)sni o'chirish

source: Thanks for spending some quality time with the Web site today.
uz: Bugun biz bilan bir oz foydali vaqt o'tkazganingiz uchun tashakkur

source: Log in again
uz: Qayta kirish

source: Password change
uz: Parolni o'zgartirish

source: Your password was changed.
uz: Sizning parolingiz o'zgartirildi

source: Change my password
uz: Parolni o'zgartirish

source: Password reset
uz: Parolni tiklash

source: Your password has been set. You may go ahead and log in now.
uz: Parolingiz o'rnatildi. Hisobingizga kirishingiz mumkin.

source: Password reset confirmation
uz: Parolni tiklashni tasdiqlash

source: Please enter your new password twice so we can verify you typed it in correctly.
uz: Iltimos, yangi parolingizni ikki marta kiriting, shunda biz uni to'g'ri kiritganingizni" "tasdiqlashimiz mumkin

source: New password:
uz: Yangi parol

source: Confirm password:
uz: Parolni tasdiqlash

source: The password reset link was invalid, possibly because it has already been used. Please request a new password reset.
uz: Parolni qayta tiklash uchun so'rov yuboring.

source: We’ve emailed you instructions for setting your password, if an account exists with the email you entered. You should receive them shortly.
uz: Agar siz kiritgan elektron pochta orqali hisob mavjud bo'lsa, parolni o'rnatish bo'yicha" "ko'rsatmalarni elektron pochta orqali jo'natdik. Tez orada ularni qabul qilishingiz kerak.

source: If you don’t receive an email, please make sure you’ve entered the address you registered with, and check your spam folder.
uz: Agar elektron pochta xabarini olmasangiz, ro'yxatdan o'tgan manzilingizni kiritganingizga" "ishonch hosil qiling va spam papkangizni tekshiring

source: You're receiving this email because you requested a password reset for your user account at %(site_name)s.
uz: Siz ushbu elektron xatni %(site_name)s da foydalanuvchi hisob qaydnomangiz parolini" "tiklashni talab qilganingiz uchun olasiz

source: Please go to the following page and choose a new password:
uz: Iltimos, quyidagi sahifaga o'ting va yangi parolni tanlang:

source: Your username, in case you’ve forgotten:
uz: Agar, siz username ni unutgan bo'lsangiz:

source: Thanks for using our site!
uz: Saytimizdan foydalanganingiz uchun tashakkur!

source: The %(site_name)s team
uz: %(site_name)s sayti jamoasi

source: Forgotten your password? Enter your email address below, and we’ll email instructions for setting a new one.
uz: Parolni unutdingizmi? Quyida emailingizni kiriting va biz yangisini o'rnatish bo'yicha" "ko'rsatmalarni elektron pochta orqali yuboramiz.

source: Email address:
uz: Email:

source: Reset my password
uz: Parolimni tiklash

source: All dates
uz: Barcha sanalar

source: Select %s
uz: %s tanlash

source: Select %s to change
uz: O'zgartirish uchun %s tanlash

source: Select %s to view
uz: Ko'rish uchun %s tanlash

source: Date:
uz: Sana

source: Time:
uz: Vaqt

source: Lookup
uz: Izlash

source: Currently:
uz: Hozirgi:

source: Change:
uz: O'zgartirish
